Terraform plan for __ibo__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_scheduler_job.scheduler["fos-engine-cron-fallback-v1"] will be created
  + resource "google_cloud_scheduler_job" "scheduler" {
      + attempt_deadline = "320s"
      + description      = "http job"
      + id               = (known after apply)
      + name             = "fos-engine-cron-fallback-v1"
      + project          = (known after apply)
      + region           = (known after apply)
      + schedule         = "*/2 * * * *"
      + time_zone        = "Asia/Calcutta"

      + http_target {
          + http_method = "POST"
          + uri         = "https://api.ibo.com/fos-engine/api/v1/user-creation/trigger-fallback"
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

  # google_cloud_scheduler_job.scheduler["trigger-online-order-notification-v1"] will be created
  + resource "google_cloud_scheduler_job" "scheduler" {
      + attempt_deadline = "320s"
      + description      = "http job"
      + id               = (known after apply)
      + name             = "trigger-online-order-notification-v1"
      + project          = (known after apply)
      + region           = (known after apply)
      + schedule         = "0 */2 * * *"
      + time_zone        = "Asia/Calcutta"

      + http_target {
          + http_method = "POST"
          + uri         = "https://asia-south1-ibo-prod.cloudfunctions.net/send-orders-notifications?reportType=ONLINE"
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

  # google_cloud_scheduler_job.scheduler["trigger-store-order-notification-v1"] will be created
  + resource "google_cloud_scheduler_job" "scheduler" {
      + attempt_deadline = "320s"
      + description      = "http job"
      + id               = (known after apply)
      + name             = "trigger-store-order-notification-v1"
      + project          = (known after apply)
      + region           = (known after apply)
      + schedule         = "0 */2 * * *"
      + time_zone        = "Asia/Calcutta"

      + http_target {
          + http_method = "POST"
          + uri         = "https://asia-south1-ibo-prod.cloudfunctions.net/send-orders-notifications"
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #455](https://github.com/ebomart/commerce-infrastructure/actions/runs/1892343669)